let simonenkoPoem = [
  "Ти знаєш, що ти – людина?",
  "Ти знаєш про це чи ні?",
  "Усмішка твоя – єдина,",
  "Мука твоя – єдина,",
  "Очі твої – одні.",
  "Більше тебе не буде.",
  "Завтра на цій землі",
  "Інші ходитимуть люди,",
  "Інші кохатимуть люди –",
  "Добрі, ласкаві й злі.",
  "Сьогодні усе для тебе –",
  "Озера, гаї, степи.",
  "І жити спішити треба,",
  "Кохати спішити треба –",
  "Гляди ж не проспи!",
  "Бо ти на землі – людина,",
  "І хочеш того чи ні –",
  "Усмішка твоя – єдина,",
  "Мука твоя – єдина,",
  "Очі твої – одні.",
];
let kostenkoPoem = [
  "Життя іде і все без коректур.",
  "І час летить, не стишує галопу.",
  "Давно нема маркізи Помпадур,",
  "і ми живем уже після потопу.",
  "Не знаю я, що буде після нас,",
  "в які природа убереться шати.",
  "Єдиний, хто не втомлюється, – час.",
  "А ми живі, нам треба поспішати.",
  "Зробити щось, лишити по собі,",
  "а ми, нічого, – пройдемо, як тіні,",
  "щоб тільки неба очі голубі",
  "цю землю завжди бачили в цвітінні.",
  "Щоб ці ліси не вимерли, як тур,",
  "щоб ці слова не вичахли, як руди.",
  "Життя іде і все без коректур,",
  "і як напишеш, так уже і буде.",
  "Але не бійся прикрого рядка.",
  "Прозрінь не бійся, бо вони як ліки.",
  "Не бійся правди, хоч яка гірка,",
  "не бійся смутків, хоч вони як ріки.",
  "Людині бійся душу ошукать,",
  "бо в цьому схибиш – то уже навіки.",
];
let semenkoPoem = [
  "Осте сте",
  "бі бо",
  "бу",
  "візники — люди",
  "трамваї — люди",
  "автомобілібілі",
  "бігорух рухобіги",
  "рухливобіги",
  "berceus кару",
  "селі",
  "елі",
  "лілі",
  "пути велетні",
  "диму сталь",
  "палять",
  "пах",
  "пахка",
  "пахітоска",
  "дим синій",
  "чорний дим",
  "пускають",
  "бензин",
  "чаду благать",
  "кохать кахикать",
  "життєдать",
  "життєрух",
  "життєбензин",
  "авто",
  "трам.",
];
let morrisonPoem = [
  "Любов прихована в найдивніших місцях.",
  "Любов прихована у знайомих обличчях.",
  "Любов приходить, коли зовсім її не чекаєш.",
  "Любов прихована у вузьких кутах.",
  "Любов приходить до тих, хто шукає.",
  "Любов прихована всередині веселки.",
  "Любов прихована в структурі молекул.",
  "Любов — це відповідь на все.",
];
let author = prompt("Який автор? (Симоненко, Костенко, Семенко, Моррісон)");
let moreDivintion = true;
while (moreDivintion) {
  switch (author) {
    case (author = "Симоненко"):
      alert(simonenkoPoem[Math.floor(Math.random() * simonenkoPoem.length)]);
      break;
    case (author = "Костенко"):
      alert(kostenkoPoem[Math.floor(Math.random() * kostenkoPoem.length)]);
      break;
    case (author = "Семенко"):
      alert(semenkoPoem[Math.floor(Math.random() * semenkoPoem.length)]);
      break;
    case (author = "Моррісон"):
      alert(morrisonPoem[Math.floor(Math.random() * morrisonPoem.length)]);
      break;
    default:
      alert("У мене нема такого автора :(");
      break;
  }
  moreDivintion = confirm("Ще передбачення?");
  if (!moreDivintion) break;
  if (!confirm("Той же автор?"))
    author = prompt("Який автор? (Симоненко, Костенко, Семенко, Моррісон)");
}
